package com.east.demo.other.algorithm.map;

/**
 * 电脑病毒感染
 *
 * @author: east
 * @date: 2024/3/7 21:19
 */

public class ComputerVirus {
    /**
     * 一个局域网内有很多台电脑，分别标注为 0 ~ N-1 的数字。相连接的电脑距离不一样，所以感染时间不一样，感染时间用t 表示。其中网络内一台电脑被病毒感染，求其感染网络内所有的电脑最少需要多长时间。如果最后有电脑不会感染，则返回-1.
     * 给定一个数组 times 表示一台电脑把相邻电脑感染所用的时间如图: path[i] = {i,j,t} 表示: 电脑i -> j，电脑i 上的病毒感染j，需要时间 t。
     *
     * 第一行输入一个整数N ，表示局域网内电脑个数 N，1<= N<= 200 :
     * 第二行输入一个整数M ,表示有 M 条网络连接;
     * 接下来M行 ,每行输入为 i,j,t 。表示电脑i感染电脑 需要时间t。 (1 <=i,j <= N)最后一行为病毒所在的电脑编号
     * 输出描述:
     * 输出最少需要多少时间才能感染全部电脑，如果不存在输出 -1
     *
     * 示例1：
     * 输入:
     * 4
     * 3
     * 2 1 1
     * 2 3 1
     * 3 4 1
     * 2
     * 输出:
     * 2
     *
     * 初始化该图的带权邻接矩阵（也可以用邻接表）
     *   0 1 2 3
     * 0 0 1 0 0
     * 1 1 0 1 0
     * 2 0 1 0 1
     * 3 0 0 1 0
     *
     * 查看从编号2号机开始，一轮感染多少个（判断一下权重），是否多轮后所有感染
     *
     */
}
